app/Services/AuthService.php

    public function findOrCreate(string $telephone): array
    {
        $telephone = normalize_phone($telephone);

        $client = $this->clientModel->findByTelephone($telephone);

        if ($client !== null) {
            return $client;
        }

        $id = $this->clientModel->insert(['telephone' => $telephone, 'solde' => 0], true);

        return $this->clientModel->find($id);
---
INSERT INTO `clients` (`telephone`, `solde`) VALUES ('0301111111', 0)
SELECT *
FROM `clients`
WHERE `clients`.`id` = 5