app/Services/MultipleTransferService.php

    public function validate(int $sourceClientId, array $beneficiaires): array
    {
        $errors = [];
        $operators = [];

        // Récupérer l'opérateur du source
        $source = $this->clientModel->find($sourceClientId);
---
SELECT *
FROM `clients`
WHERE `clients`.`id` = 5

    public function transfer(
        int $sourceClientId,
        array $beneficiaires,
        float $montantParBeneficiaire
    ): array {
        if ($montantParBeneficiaire <= 0) {
            throw new RuntimeException('Le montant par bénéficiaire doit être supérieur à zéro.');
        }

        // Validation préalable
        $validation = $this->validate($sourceClientId, $beneficiaires);
        if (! $validation['valid']) {
            throw new RuntimeException('Validation échouée : ' . implode('; ', $validation['errors']));
        }

        $db = Database::connect();
        $db->transStart();

        try {
            $source = $this->clientModel->find($sourceClientId);
---
SELECT *
FROM `clients`
WHERE `clients`.`id` = 5