app/Services/OperatorDetectionService.php

    protected function isInternalPrefix(string $prefix): bool
    {
        if (in_array($prefix, ['030', '039'], true)) {
            return true;
        }

        return $this->prefixModel->where('prefix', $prefix)->where('actif', 1)->first() !== null;
---
SELECT *
FROM `prefixes`
WHERE `prefix` = '034'
AND `actif` = 1
 LIMIT 1