app/Services/OperationService.php

    public function deposit(int $clientId, float $montant): array
    {
        if ($montant <= 0) {
            throw new RuntimeException('Le montant doit être supérieur à zéro.');
        }

        $db = Database::connect();
        $db->transStart();

        try {
            $client = $this->clientModel->find($clientId);

            if ($client === null) {
                throw new RuntimeException('Client introuvable.');
            }

            $soldeAvant = (float) $client['solde'];
            $soldeApres = $soldeAvant + $montant;

            $reference = $this->referenceService->generate();

            $this->transactionModel->insert([
                'reference'             => $reference,
                'operation_type_id'     => self::DEPOT,
                'client_source_id'      => $clientId,
                'client_destination_id' => null,
                'montant'               => $montant,
                'frais'                 => 0,
                'montant_total'         => $montant,
                'solde_avant'           => $soldeAvant,
                'solde_apres'           => $soldeApres,
            ]);
---
SELECT *
FROM `clients`
WHERE `clients`.`id` = 5
INSERT INTO `transactions` (`reference`, `operation_type_id`, `client_source_id`, `client_destination_id`, `destination_telephone`, `montant`, `frais`, `commission_supplementaire`, `montant_total`, `is_external`, `external_operator_id`, `solde_avant`, `solde_apres`) VALUES ('MM20260720000008', 1, 5, NULL, NULL, 10000000, 0, 0, 10000000, 0, NULL, 0, 10000000)

            throw new RuntimeException('Une erreur est survenue lors du dépôt.');
        }

        return $this->transactionModel->where('reference', $reference)->first();
---
SELECT *
FROM `transactions`
WHERE `reference` = 'MM20260720000008'
 LIMIT 1

    public function withdraw(int $clientId, float $montant): array
    {
        if ($montant <= 0) {
            throw new RuntimeException('Le montant doit être supérieur à zéro.');
        }

        $db = Database::connect();
        $db->transStart();

        try {
            $client = $this->clientModel->find($clientId);

            if ($client === null) {
                throw new RuntimeException('Client introuvable.');
            }

            $soldeAvant   = (float) $client['solde'];
            $fee          = $this->feeService->calculateFee(self::RETRAIT, $montant, true);
            $montantTotal = $fee['montant_total'];
            $soldeApres   = $soldeAvant - $montantTotal;

            if ($soldeApres < 0) {
                throw new RuntimeException('Solde insuffisant pour effectuer ce retrait.');
            }

            $reference = $this->referenceService->generate();

            $this->transactionModel->insert([
                'reference'             => $reference,
                'operation_type_id'     => self::RETRAIT,
                'client_source_id'      => $clientId,
                'client_destination_id' => null,
                'montant'               => $montant,
                'frais'                 => $fee['frais'],
                'montant_total'         => $montantTotal,
                'solde_avant'           => $soldeAvant,
                'solde_apres'           => $soldeApres,
            ]);
---
SELECT *
FROM `clients`
WHERE `clients`.`id` = 5
INSERT INTO `transactions` (`reference`, `operation_type_id`, `client_source_id`, `client_destination_id`, `destination_telephone`, `montant`, `frais`, `commission_supplementaire`, `montant_total`, `is_external`, `external_operator_id`, `solde_avant`, `solde_apres`) VALUES ('MM20260720000009', 2, 5, NULL, NULL, 10000, 100, 0, 10100, 0, NULL, 10000000, 9989900)

            throw new RuntimeException('Une erreur est survenue lors du retrait.');
        }

        return $this->transactionModel->where('reference', $reference)->first();
---
SELECT *
FROM `transactions`
WHERE `reference` = 'MM20260720000009'
 LIMIT 1

    public function transfer(int $sourceId, string $destinationTelephone, float $montant): array
    {
        if ($montant <= 0) {
            throw new RuntimeException('Le montant doit être supérieur à zéro.');
        }

        $destinationTelephone = normalize_phone($destinationTelephone);

        $db = Database::connect();
        $db->transStart();

        try {
            $source = $this->clientModel->find($sourceId);
---
SELECT *
FROM `clients`
WHERE `clients`.`id` = 5


            $reference = $this->referenceService->generate();

            $this->transactionModel->insert([
                'reference'             => $reference,
                'operation_type_id'     => self::TRANSFERT,
                'client_source_id'      => $sourceId,
                'client_destination_id' => $destination['id'],
                'montant'               => $montant,
                'frais'                 => $fee['frais'],
                'montant_total'         => $montantTotal,
                'solde_avant'           => $soldeAvant,
                'solde_apres'           => $soldeApres,
            ]);
---
INSERT INTO `transactions` (`reference`, `operation_type_id`, `client_source_id`, `client_destination_id`, `destination_telephone`, `montant`, `frais`, `frais_retrait`, `commission_supplementaire`, `montant_total`, `is_external`, `external_operator_id`, `solde_avant`, `solde_apres`) VALUES ('MM20260721000002', 3, 5, NULL, '0344129084', 200000, 1500, 0, 75, 201575, 1, 1, 400000, 198425)

            throw new RuntimeException('Une erreur est survenue lors du transfert.');
        }

        return $this->transactionModel->where('reference', $reference)->first();
---
SELECT *
FROM `transactions`
WHERE `reference` = 'MM20260721000002'
 LIMIT 1