app/Services/ReportService.php

    public function generate(array $filters = []): array
    {
        $db = Database::connect();

        $transferBuilder = $db->table('transactions')
            ->where('operation_type_id', OperationService::TRANSFERT);

        $this->applyFilters($transferBuilder, $filters);

        $transferts = $transferBuilder->get()->getResultArray();

        $internes = array_filter($transferts, static fn ($t) => (int) $t['is_external'] === 0);
        $externes = array_filter($transferts, static fn ($t) => (int) $t['is_external'] === 1);

        $repartitionTransferts = [
            ['label' => 'Internes', 'nombre' => count($internes), 'montant' => array_sum(array_column($internes, 'montant'))],
            ['label' => 'Externes', 'nombre' => count($externes), 'montant' => array_sum(array_column($externes, 'montant'))],
        ];

        $revenusInternes = array_sum(array_column($internes, 'frais'));
        $revenusExternes = array_sum(array_column($externes, 'frais')) + array_sum(array_column($externes, 'commission_supplementaire'));

        $repartitionRevenus = [
            ['label' => 'Frais internes', 'montant' => $revenusInternes],
            ['label' => 'Frais + commission externe', 'montant' => $revenusExternes],
        ];

        $montantsDus = $db->table('vue_montants_a_envoyer')
            ->orderBy('montant_net_a_envoyer', 'DESC')
            ->get()->getResultArray();

        $topOperateurs = $db->table('transactions')
            ->select('operators.nom AS operateur, COUNT(transactions.id) AS nb, SUM(transactions.montant) AS montant, SUM(transactions.frais + transactions.commission_supplementaire) AS revenus')
            ->join('operators', 'operators.id = transactions.external_operator_id')
            ->where('transactions.is_external', 1)
            ->where('transactions.operation_type_id', OperationService::TRANSFERT)
            ->groupBy('operators.id')
            ->orderBy('montant', 'DESC')
            ->limit(5)
            ->get()->getResultArray();
---
SELECT *
FROM `transactions`
WHERE `operation_type_id` = 3
SELECT *
FROM `vue_montants_a_envoyer`
ORDER BY `montant_net_a_envoyer` DESC
SELECT `operators`.`nom` AS `operateur`, COUNT(transactions.id) AS nb, SUM(transactions.montant) AS montant, SUM(transactions.frais + transactions.commission_supplementaire) AS revenus
FROM `transactions`
JOIN `operators` ON `operators`.`id` = `transactions`.`external_operator_id`
WHERE `transactions`.`is_external` = 1
AND `transactions`.`operation_type_id` = 3
GROUP BY `operators`.`id`
ORDER BY `montant` DESC
 LIMIT 5