app/Services/StatisticsService.php

    public function getGlobalStats(): array
    {
        $db = Database::connect();

        $externalStats = $db->table('vue_gains_externes')->get()->getRowArray() ?? [];

        return [
            'nb_clients'                  => $this->clientModel->countAllResults(),
            'nb_depots'                 => $this->transactionModel->countByType(self::DEPOT),
            'nb_retraits'               => $this->transactionModel->countByType(self::RETRAIT),
            'nb_transferts'             => $this->transactionModel->countByType(self::TRANSFERT),
            'total_depots'              => $this->transactionModel->sumByType(self::DEPOT, 'montant'),
            'total_retraits'            => $this->transactionModel->sumByType(self::RETRAIT, 'montant'),
            'total_transferts'          => $this->transactionModel->sumByType(self::TRANSFERT, 'montant'),
            'revenu_frais'              => $this->transactionModel->sumByType(self::RETRAIT, 'frais')
                                            + $this->transactionModel->sumByType(self::TRANSFERT, 'frais')
                                            + $this->transactionModel->sumByType(self::TRANSFERT, 'frais_retrait'),
            'nb_operateurs'             => $this->operatorModel->countActive(),
            'nb_transferts_externes'    => (int) ($externalStats['nb_transferts'] ?? 0),
            'montant_transferts_externes' => (float) ($externalStats['total_montant'] ?? 0),
            'commission_sup_collectee'  => (float) ($externalStats['total_commission_sup'] ?? 0),
            'nb_transferts_internes'    => $this->transactionModel->countInternalTransfers(),
            'dernieres_operations'      => $this->transactionModel
                ->select('transactions.*, operation_types.nom AS type_operation, c1.telephone AS expediteur, COALESCE(c2.telephone, transactions.destination_telephone) AS destinataire, o.nom AS operateur_externe')
                ->join('operation_types', 'operation_types.id = transactions.operation_type_id')
                ->join('clients c1', 'c1.id = transactions.client_source_id')
                ->join('clients c2', 'c2.id = transactions.client_destination_id', 'left')
                ->join('operators o', 'o.id = transactions.external_operator_id', 'left')
                ->orderBy('transactions.created_at', 'DESC')
                ->findAll(10),
---
SELECT *
FROM `vue_gains_externes`
SELECT `transactions`.*, `operation_types`.`nom` AS `type_operation`, `c1`.`telephone` AS `expediteur`, COALESCE(c2.telephone, transactions.destination_telephone) AS destinataire, `o`.`nom` AS `operateur_externe`
FROM `transactions`
JOIN `operation_types` ON `operation_types`.`id` = `transactions`.`operation_type_id`
JOIN `clients` `c1` ON `c1`.`id` = `transactions`.`client_source_id`
LEFT JOIN `clients` `c2` ON `c2`.`id` = `transactions`.`client_destination_id`
LEFT JOIN `operators` `o` ON `o`.`id` = `transactions`.`external_operator_id`
ORDER BY `transactions`.`created_at` DESC
 LIMIT 10

    public function getGains(array $filters = []): array
    {
        $db = Database::connect();

        $revenus = $db->table('vue_revenus_operateur')->get()->getResultArray();

        $detailBuilder = $db->table('vue_historique')
            ->whereIn('type_operation', ['Retrait', 'Transfert']);

        if (! empty($filters['date_debut'])) {
            $detailBuilder->where('date_operation >=', $filters['date_debut'] . ' 00:00:00');
        }
        if (! empty($filters['date_fin'])) {
            $detailBuilder->where('date_operation <=', $filters['date_fin'] . ' 23:59:59');
        }
        if (! empty($filters['type'])) {
            $detailBuilder->where('type_operation', $filters['type']);
        }

        $details      = $detailBuilder->orderBy('date_operation', 'DESC')->get()->getResultArray();
---
SELECT *
FROM `vue_revenus_operateur`
SELECT *
FROM `vue_historique`
WHERE `type_operation` IN ('Retrait','Transfert')
ORDER BY `date_operation` DESC

    public function getSettlementStats(array $filters = [], string $sort = 'operateur', string $order = 'ASC'): array
    {
        $db = Database::connect();

        $builder = $db->table('vue_montants_a_envoyer');

        if (! empty($filters['search'])) {
            $builder->like('operateur', $filters['search']);
        }

        $allowedSort = ['operateur', 'nb_transferts', 'montant_total', 'commission_percue', 'montant_net_a_envoyer', 'derniere_date'];
        $sort        = in_array($sort, $allowedSort, true) ? $sort : 'operateur';
        $order       = strtoupper($order) === 'DESC' ? 'DESC' : 'ASC';

        $rows = $builder->orderBy($sort, $order)->get()->getResultArray();
---
SELECT *
FROM `vue_montants_a_envoyer`
ORDER BY `operateur` DESC

    public function getAdvancedStats(): array
    {
        $db = Database::connect();

        $parJour = $db->table('transactions')
            ->select("date(created_at) AS jour, COUNT(*) AS nombre")
            ->groupBy('jour')->orderBy('jour', 'DESC')->limit(14)
            ->get()->getResultArray();

        $parMois = $db->table('transactions')
            ->select("strftime('%Y-%m', created_at) AS mois, COUNT(*) AS nombre")
            ->groupBy('mois')->orderBy('mois', 'DESC')->limit(12)
            ->get()->getResultArray();

        $parType = $db->table('transactions')
            ->select('operation_types.nom AS type_operation, COUNT(*) AS nombre, SUM(transactions.montant) AS total_montant, SUM(transactions.frais) AS total_frais')
            ->join('operation_types', 'operation_types.id = transactions.operation_type_id')
            ->groupBy('operation_types.nom')
            ->get()->getResultArray();

        $topClients = $db->table('transactions')
            ->select('clients.telephone, clients.nom, COUNT(*) AS nb_operations, SUM(transactions.montant) AS volume')
            ->join('clients', 'clients.id = transactions.client_source_id')
            ->groupBy('clients.id')->orderBy('volume', 'DESC')->limit(5)
            ->get()->getResultArray();
---
SELECT date(created_at) AS jour, COUNT(*) AS nombre
FROM `transactions`
GROUP BY `jour`
ORDER BY `jour` DESC
 LIMIT 14
SELECT strftime('%Y-%m', created_at) AS mois, COUNT(*) AS nombre
FROM `transactions`
GROUP BY `mois`
ORDER BY `mois` DESC
 LIMIT 12
SELECT `operation_types`.`nom` AS `type_operation`, COUNT(*) AS nombre, SUM(transactions.montant) AS total_montant, SUM(transactions.frais) AS total_frais
FROM `transactions`
JOIN `operation_types` ON `operation_types`.`id` = `transactions`.`operation_type_id`
GROUP BY `operation_types`.`nom`
SELECT `clients`.`telephone`, `clients`.`nom`, COUNT(*) AS nb_operations, SUM(transactions.montant) AS volume
FROM `transactions`
JOIN `clients` ON `clients`.`id` = `transactions`.`client_source_id`
GROUP BY `clients`.`id`
ORDER BY `volume` DESC
 LIMIT 5