app/Controllers/Client/BalanceController.php

SELECT *
FROM `clients`
WHERE `clients`.`id` = 1
---
    public function index()
    {
        $clientId = (int) session()->get('client_id');

        $clientModel      = new ClientModel();
        $transactionModel = new TransactionModel();

        $client     = $clientModel->find($clientId);