app/Controllers/Client/DashboardController.php

SELECT *
FROM `clients`
WHERE `clients`.`id` = 5
---
    public function index()
    {
        $clientId = (int) session()->get('client_id');

        $clientModel      = new ClientModel();
        $transactionModel = new TransactionModel();

        $client     = $clientModel->find($clientId);