app/Controllers/Client/DepositController.php

SELECT *
FROM `clients`
WHERE `clients`.`id` = 1
---
    public function create()
    {
        $client = (new ClientModel())->find(session()->get('client_id'));