app/Controllers/Client/MultipleTransferController.php

SELECT *
FROM `clients`
WHERE `clients`.`id` = 5
---
            );

            $montantTotal = $fee['montant_total'] * count($list);
            $client = (new ClientModel())->find($clientId);