app/Controllers/Client/WithdrawalController.php

    public function create()
    {
        $client = (new ClientModel())->find(session()->get('client_id'));
---
SELECT *
FROM `clients`
WHERE `clients`.`id` = 1