app/Controllers/Admin/OperatorPrefixController.php

    public function index()
    {
        $search = $this->request->getGet('search');
        $page   = (int) ($this->request->getGet('page') ?? 1);

        $query = $this->prefixModel->withOperator()->orderBy('operator_prefixes.id', 'DESC');

        if ($search) {
            $query->groupStart()
                ->like('operator_prefixes.prefix', $search)
                ->orLike('operators.nom', $search)
            ->groupEnd();
        }

        $prefixes = $query->paginate(10, 'default', $page);
---
SELECT COUNT(*) AS `numrows`
FROM `operator_prefixes`
JOIN `operators` ON `operators`.`id` = `operator_prefixes`.`operator_id`
SELECT `operator_prefixes`.*, `operators`.`nom` AS `operator_nom`, `operators`.`code` AS `operator_code`
FROM `operator_prefixes`
JOIN `operators` ON `operators`.`id` = `operator_prefixes`.`operator_id`
ORDER BY `operator_prefixes`.`id` DESC
 LIMIT 10