app/Controllers/Admin/OperationTypeController.php

    public function index()
    {
        $search = $this->request->getGet('search');
        $page   = (int) ($this->request->getGet('page') ?? 1);

        $query = $this->operationTypeModel->orderBy('id', 'ASC');

        if ($search) {
            $query->like('nom', $search);
        }

        $types = $query->paginate(10, 'default', $page);
---
SELECT *
FROM `operation_types`
ORDER BY `id` ASC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `operation_types`