app/Controllers/Admin/PrefixController.php

    public function index()
    {
        $search = $this->request->getGet('search');
        $page   = (int) ($this->request->getGet('page') ?? 1);

        $query = $this->prefixModel->orderBy('id', 'DESC');

        if ($search) {
            $query->like('prefix', $search);
        }

        $prefixes = $query->paginate(10, 'default', $page);
---
SELECT *
FROM `prefixes`
ORDER BY `id` DESC
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `prefixes`