app/Models/ClientModel.php

SELECT *
FROM `clients`
WHERE `telephone` = '0301111111'
 LIMIT 1
---
    public function findByTelephone(string $telephone): ?array
    {
        return $this->where('telephone', $telephone)->first();