app/Models/FeeScaleModel.php

SELECT *
FROM `fee_scales`
WHERE `operation_type_id` = 3
AND `montant_min` <= 200000
AND `montant_max` >= 200000
 LIMIT 1
---
    public function findForAmount(int $operationTypeId, float $montant): ?array
    {
        return $this->where('operation_type_id', $operationTypeId)
            ->where('montant_min <=', $montant)
            ->where('montant_max >=', $montant)
            ->first();

SELECT `fee_scales`.*, `operation_types`.`nom` AS `operation_nom`
FROM `fee_scales`
JOIN `operation_types` ON `operation_types`.`id` = `fee_scales`.`operation_type_id`
ORDER BY `operation_types`.`nom` ASC, `fee_scales`.`montant_min` ASC
---
    public function getWithType(): array
    {
        return $this->select('fee_scales.*, operation_types.nom AS operation_nom')
            ->join('operation_types', 'operation_types.id = fee_scales.operation_type_id')
            ->orderBy('operation_types.nom', 'ASC')
            ->orderBy('fee_scales.montant_min', 'ASC')
            ->findAll();