app/Models/InterOperatorCommissionModel.php

SELECT *
FROM `inter_operator_commissions`
WHERE `actif` = 1
ORDER BY `id` DESC
 LIMIT 1
---
    public function getActive(): ?array
    {
        return $this->where('actif', 1)->orderBy('id', 'DESC')->first();