app/Models/OperatorPrefixModel.php

    public function findByPrefix(string $prefix): ?array
    {
        return $this->select('operator_prefixes.*, operators.nom AS operator_nom, operators.code AS operator_code')
            ->join('operators', 'operators.id = operator_prefixes.operator_id')
            ->where('operator_prefixes.prefix', $prefix)
            ->where('operator_prefixes.actif', 1)
            ->where('operators.actif', 1)
            ->first();
---
SELECT `operator_prefixes`.*, `operators`.`nom` AS `operator_nom`, `operators`.`code` AS `operator_code`
FROM `operator_prefixes`
JOIN `operators` ON `operators`.`id` = `operator_prefixes`.`operator_id`
WHERE `operator_prefixes`.`prefix` = '034'
AND `operator_prefixes`.`actif` = 1
AND `operators`.`actif` = 1
 LIMIT 1