app/Models/OperatorModel.php

    public function countActive(): int
    {
        return $this->where('actif', 1)->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `operators`
WHERE `actif` = 1