app/Models/TransactionModel.php

SELECT COUNT(*) AS `numrows`
FROM `transactions`
WHERE `operation_type_id` = 1
---
    public function countByType(int $operationTypeId): int
    {
        return $this->where('operation_type_id', $operationTypeId)->countAllResults();

SELECT COUNT(*) AS `numrows`
FROM `transactions`
WHERE `operation_type_id` = 3
AND `is_external` = 0
---
    public function countInternalTransfers(): int
    {
        return $this->where('operation_type_id', 3)->where('is_external', 0)->countAllResults();

SELECT *
FROM `transactions`
WHERE   (
`client_source_id` = 5
OR `client_destination_id` = 5
 )
ORDER BY `created_at` DESC
---
    public function forClient(int $clientId): array
    {
        return $this->groupStart()
                ->where('client_source_id', $clientId)
                ->orWhere('client_destination_id', $clientId)
            ->groupEnd()
            ->orderBy('created_at', 'DESC')
            ->findAll();